---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendTextType
source: html/69af6934-c9a5-11ce-9387-35cc5bdec150.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendTextType Property

"Overall Legend Text"

## Syntax (C#)
```csharp
public static ForgeTypeId SpatialFieldMgrLegendTextType { get; }
```